Repository: wp-plugins/easy-digital-downloads-taxamo-integration
Catalog: languages/taxamoedd-*.po
Languages: fi

source: EDD Taxamo Integration
fi: EDD Taxamo integraatio

source: requires Easy Digital Downloads! Please activate it to continue!
fi: vaatii Easy Digital Downloads -lisäosan! Aktivoi se ensin, jotta pääset eteenpäin!

source: requires Easy Digital Downloads! Please install it to continue!
fi: vaatii Easy Digital Downloads -lisäosan! Asenna se ensin, jotta pääset eteenpäin!

source: Taxamo Integration
fi: Taxamo integraatio

source: Taxamo Public Token
fi: Taxamo julkinen unnus:

source: Available from <a href="%s">Taxamo</a>.
fi: Saatavilla <a href="%s">Taxamon</a> sivuilta.

source: Taxamo Private Token
fi: Taxamo salainen tunnus:

source: Ask for VAT Number?
fi: Kysy VAT-numeroa?

source: If you wish to ask the user for a VAT number, please check this box.
fi: Jos haluat kysyä VAT-numeroa, niin valitse tämä.

source: Custom ID Format
fi: ID-muoto

source: Format of the Custom ID.<br/>The string %%ID%% is replaced with the payment ID.
fi: ID-numeron muoto.<br/>%%ID%% korvautuu maksu ID-numerolla.

source: Custom Invoice Format
fi: Kuitin muoto

source: Format of the Invoice Number.<br/>The string %%ID%% is replaced with the payment ID.
fi: Kuitin ID-numeron muoto.<br/>%%ID%% korvautuu maksun ID-numerolla.

source: Introduction Header Text
fi: Intro otsikkoteksti

source: This text will be added before the extra fields. Use this to link to your privacy policy and why you need this information
fi: Tämä teksti näytetään ennen lisäkenttiä. Kirjoita tähän linkki sivuston ostosääntöihin ja miksi tarvitset tätä informaatiota

source: By clicking this checkbox, I can confirm my billing address is valid and is located in my usual country of residence.
fi: Valitsemalla tämän vahvistan, että laskutusosoitteeni on oikea ja sijaitsee siellä missä olen.

source: I am registered for VAT in the EU
fi: Olen VAT-rekisteröity EU:ssa

source: VAT Number
fi: VAT-numero

source: If you are registered for VAT, place your VAT number here (no spaces).
fi: Jos olet VAT-rekisteröity, kirjoita VAT-numero ilman välilyöntejä.

source: If you are VAT registered, please enter a VAT number.
fi: Jos olet VAT-rekisteröity, kirjoita VAT-numero.

source: The VAT number is invalid. Please double check or untick the VAT Registered Box.
fi: VAT-numero on virheellinen. Tarkista se uudelleen tai ota VAT-numero pois käytöstä.

source: Private key not present, so unable to complete purchase. Please contact shop owner.
fi: Avain puuttuu, joten ostosta ei voitu suorittaa loppuun. Ota yhteys kauppiaaseen.

source: Please confirm that the billing address is correct.
fi: Ole hyvä ja varmista, että laskutusosoite on oikein.

source: VAT Number:
fi: VAT-numero:

source: If the customer had a VAT number, it will be here
fi: Jos asiakkaalla oli VAT-numero, se näkyy tässä

source: Taxamo Integration needs Taxes to be Enabled. <a href="%s">Click Here to enable Taxes</a>.
fi: Taxamo vaatii verojen käytön sivustolla. <a href="%s">Klikkaa tästä, niin saat verot käyttöön</a>.

source: You need to add the Taxamo Public & Private Keys to the extension. <a href="%s"><strong>Sign Up for Taxamo</strong></a> and then <a href="%s">Click Here to add these fields</a>.
fi: Sinun tarvitsee antaa Taxamo avaimet. <a href="%s"><strong>Kirjaudu Taxamoon</strong></a> ja <a href="%s">klikkaa tästä täyttääksesi kentät</a>.
